Revit 2027 API
IFCExtrusionData.GetLoops Method
 Gets the curve loops that form the base shape of the extrusion.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<CurveLoop> GetLoops()
Public Function GetLoops As IList(Of CurveLoop)
public:
IList<CurveLoop^>^ GetLoops()
member GetLoops : unit -> IList<CurveLoop>
Return Value
IList<CurveLoop>
 The collection of loops.
See Also
Reference
IFCExtrusionData Class
Autodesk.Revit.DB.IFC Namespace